app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
 def edit
    if current_user.id!=params[:id].to_i then
        redirect_to articles_path
     else
    @article = Article.find(params[:id])

INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Admin"], ["text", "Welcome to this new site"], ["user_id", 1], ["created_at", "2015-04-07 05:23:09.624745"], ["updated_at", "2015-04-07 05:23:09.624745"]]
---
  def create
     @article = Article.new(article_params)
      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
def destroy
      if current_user.id!=params[:id].to_i then
         redirect_to articles_path
       else
       @article = Article.find(params[:id])
       @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
def like
@article=Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
def unlike
  @article = Article.find(params[:id])

UPDATE "users" SET "last_seen_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_seen_at", "2015-04-12 19:55:09.433679"], ["updated_at", "2015-04-12 19:55:09.434711"], ["id", 2]]
---
def set_last_seen_at
  current_user.update_attribute(:last_seen_at, Time.now)